Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.GetNeighborSections Method
 Gets neighbor sections of the geometrySection inside this ConnectiveGeometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<GeometrySection> GetNeighborSections(
	GeometrySection geometrySection
)
Public Function GetNeighborSections (
	geometrySection As GeometrySection
) As IList(Of GeometrySection)
Parameters
geometrySection
Type: Tekla.Structures.Model.GeometrySection
GeometrySection to get neighbors for.
Return Value
Type: IList<GeometrySection>
List of neighbor GeometrySection of the given GeometrySection.
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace